# Conductor Material Get Conductor Material Method

Source: https://www.revitapidocs.com/2026/e94e5e9d-0302-5c6f-2b7f-6eb0d18de312.htm

---

| Conductor Material Get Conductor Material Method |
| --- |

Gets the Conductor Material data by given Conductor Material id.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ConductorMaterial GetConductorMaterial(
	Document document,
	ElementId conductorMaterialId
)
```

```
Public Shared Function GetConductorMaterial (
	document As Document,
	conductorMaterialId As ElementId
) As ConductorMaterial
```

```
public:
static ConductorMaterial^ GetConductorMaterial(
	Document^ document,
	ElementId^ conductorMaterialId
)
```

```
static member GetConductorMaterial :
        document : Document *
        conductorMaterialId : ElementId -> ConductorMaterial
```

#### Parameters

document Document
:   The document.

conductorMaterialId ElementId
:   The Conductor Material id.

#### Return Value

ConductorMaterial
The Conductor Material data. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | document is not a project document.  \-or\-  The id is not a Conductor Material id. |
| ArgumentNullException | A non\-optional argument was null |
| InvalidOperationException | The document is in failure mode: an operation has failed,  and Revit requires the user to either cancel the operation  or fix the problem (usually by deleting certain elements). |

See Also

#### Reference

ConductorMaterial Class Autodesk.Revit.DB.Electrical Namespace